;******************************************************************************
;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
;* Date/Time created: Tue Oct 25 14:02:28 2016                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --quiet --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../Source/tasks.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram
	.dwattr $C$DW$1, DW_AT_name("vPortYieldFromISR")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("vPortYieldFromISR")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x85)
	.dwattr $C$DW$1, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$1



	.dwattr $C$DW$393, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x74)
	.dwattr $C$DW$393, DW_AT_decl_column(0x02)

$C$DW$394	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$394, DW_AT_name("eSuspended")
	.dwattr $C$DW$394, DW_AT_const_value(0x03)
	.dwattr $C$DW$394, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x75)
	.dwattr $C$DW$394, DW_AT_decl_column(0x02)

$C$DW$395	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$395, DW_AT_name("eDeleted")
	.dwattr $C$DW$395, DW_AT_const_value(0x04)
	.dwattr $C$DW$395, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x76)
	.dwattr $C$DW$395, DW_AT_decl_column(0x02)

	.dwattr $C$DW$T$60, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x71)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$60

$C$DW$T$61	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$61, DW_AT_name("eTaskState")
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$61, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x77)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x03)


$C$DW$T$66	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
$C$DW$396	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$396, DW_AT_name("eNoAction")
	.dwattr $C$DW$396, DW_AT_const_value(0x00)
	.dwattr $C$DW$396, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$396, DW_AT_decl_column(0x02)

$C$DW$397	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$397, DW_AT_name("eSetBits")
	.dwattr $C$DW$397, DW_AT_const_value(0x01)
	.dwattr $C$DW$397, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$397, DW_AT_decl_column(0x02)

$C$DW$398	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$398, DW_AT_name("eIncrement")
	.dwattr $C$DW$398, DW_AT_const_value(0x02)
	.dwattr $C$DW$398, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$398, DW_AT_decl_column(0x02)

$C$DW$399	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$399, DW_AT_name("eSetValueWithOverwrite")
	.dwattr $C$DW$399, DW_AT_const_value(0x03)
	.dwattr $C$DW$399, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$399, DW_AT_decl_column(0x02)

$C$DW$400	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$400, DW_AT_name("eSetValueWithoutOverwrite")
	.dwattr $C$DW$400, DW_AT_const_value(0x04)
	.dwattr $C$DW$400, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0x80)
	.dwattr $C$DW$400, DW_AT_decl_column(0x02)

	.dwattr $C$DW$T$66, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$66

$C$DW$T$67	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$67, DW_AT_name("eNotifyAction")
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$67, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0x81)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x03)


$C$DW$T$68	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x01)
$C$DW$401	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$401, DW_AT_name("eAbortSleep")
	.dwattr $C$DW$401, DW_AT_const_value(0x00)
	.dwattr $C$DW$401, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$401, DW_AT_decl_column(0x02)

$C$DW$402	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$402, DW_AT_name("eStandardSleep")
	.dwattr $C$DW$402, DW_AT_const_value(0x01)
	.dwattr $C$DW$402, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$402, DW_AT_decl_column(0x02)

$C$DW$403	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$403, DW_AT_name("eNoTasksWaitingTimeout")
	.dwattr $C$DW$403, DW_AT_const_value(0x02)
	.dwattr $C$DW$403, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$403, DW_AT_decl_column(0x02)

	.dwattr $C$DW$T$68, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$68

$C$DW$T$69	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$69, DW_AT_name("eSleepModeStatus")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$69, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x03)


$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$404, DW_AT_name("quot")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$404, DW_AT_decl_column(0x16)

$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$405, DW_AT_name("rem")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$405, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$19, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$19

$C$DW$T$70	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$70, DW_AT_name("div_t")
	.dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$70, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x23)


$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$406, DW_AT_name("quot")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$406, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$406, DW_AT_decl_column(0x16)

$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$407, DW_AT_name("rem")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$407, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$407, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$20, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$20

$C$DW$T$71	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$71, DW_AT_name("ldiv_t")
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$71, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x23)


$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$408, DW_AT_name("quot")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$408, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0x61)
	.dwattr $C$DW$408, DW_AT_decl_column(0x1c)

$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$409, DW_AT_name("rem")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$409, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0x61)
	.dwattr $C$DW$409, DW_AT_decl_column(0x22)

	.dwattr $C$DW$T$21, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x61)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$21

$C$DW$T$72	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$72, DW_AT_name("lldiv_t")
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$72, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x61)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x29)


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_name("HeapRegion")
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x08)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$410, DW_AT_name("pucStartAddress")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("pucStartAddress")
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$410, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\portable.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0x96)
	.dwattr $C$DW$410, DW_AT_decl_column(0x0b)

$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$411, DW_AT_name("xSizeInBytes")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("xSizeInBytes")
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$411, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\portable.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0x97)
	.dwattr $C$DW$411, DW_AT_decl_column(0x09)

	.dwattr $C$DW$T$25, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\portable.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$25

$C$DW$T$73	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$73, DW_AT_name("HeapRegion_t")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$73, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\portable.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x98)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x03)

$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)

$C$DW$T$59	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$59, DW_AT_name("TaskHandle_t")
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$59, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x67)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x10)

$C$DW$T$74	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$59)

$C$DW$T$75	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$75, DW_AT_address_class(0x20)

$C$DW$T$76	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)

$C$DW$T$78	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$78, DW_AT_name("TimerHandle_t")
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$78, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/timers.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x10)

$C$DW$T$81	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$3)


$C$DW$T$49	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
$C$DW$412	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$3)

	.dwendtag $C$DW$T$49

$C$DW$T$50	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$50, DW_AT_address_class(0x20)

$C$DW$T$51	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$51, DW_AT_name("TaskFunction_t")
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$51, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\projdefs.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x10)


$C$DW$T$83	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
	.dwendtag $C$DW$T$83

$C$DW$T$84	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$84, DW_AT_address_class(0x20)

$C$DW$T$85	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$85, DW_AT_name("__TI_atexit_fn")
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$85, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x14)

$C$DW$T$126	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$2)

$C$DW$T$127	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$127, DW_AT_address_class(0x20)


$C$DW$T$128	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
$C$DW$413	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$78)

	.dwendtag $C$DW$T$128

$C$DW$T$129	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$T$129, DW_AT_address_class(0x20)

$C$DW$T$130	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$130, DW_AT_name("TimerCallbackFunction_t")
	.dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$130, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/timers.h")
	.dwattr $C$DW$T$130, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$130, DW_AT_decl_column(0x10)


$C$DW$T$131	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
$C$DW$414	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$3)

$C$DW$415	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$27)

	.dwendtag $C$DW$T$131

$C$DW$T$132	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
	.dwattr $C$DW$T$132, DW_AT_address_class(0x20)

$C$DW$T$133	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$133, DW_AT_name("PendedFunction_t")
	.dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$133, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/timers.h")
	.dwattr $C$DW$T$133, DW_AT_decl_line(0x81)
	.dwattr $C$DW$T$133, DW_AT_decl_column(0x10)

$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)

$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)

$C$DW$T$134	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$134, DW_AT_name("int8_t")
	.dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$134, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$134, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$134, DW_AT_decl_column(0x1d)

$C$DW$T$135	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$135, DW_AT_name("int_least8_t")
	.dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
	.dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$135, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$135, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$135, DW_AT_decl_column(0x17)

$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)

$C$DW$T$22	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$22, DW_AT_name("uint8_t")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x1c)

$C$DW$T$23	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_address_class(0x20)

$C$DW$T$136	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$136, DW_AT_name("portCHAR")
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$136, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$136, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$136, DW_AT_decl_column(0x12)

$C$DW$T$137	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$137, DW_AT_name("uint_least8_t")
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$137, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$137, DW_AT_decl_line(0x38)
	.dwattr $C$DW$T$137, DW_AT_decl_column(0x16)

$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)

$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)

$C$DW$T$138	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$138, DW_AT_name("int16_t")
	.dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$138, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$138, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$138, DW_AT_decl_column(0x1d)

$C$DW$T$139	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$139, DW_AT_name("int_least16_t")
	.dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$139, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$139, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$139, DW_AT_decl_column(0x17)

$C$DW$T$140	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$140, DW_AT_name("portSHORT")
	.dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$138)
	.dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$140, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$140, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$140, DW_AT_decl_column(0x12)

$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)

$C$DW$T$55	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$55, DW_AT_name("uint16_t")
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$55, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x1c)

$C$DW$T$120	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$55)

$C$DW$T$141	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$141, DW_AT_name("uint_least16_t")
	.dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$141, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$141, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$141, DW_AT_decl_column(0x16)

$C$DW$T$142	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$142, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$142, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$142, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$142, DW_AT_decl_column(0x1a)

$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x04)


$C$DW$T$143	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
$C$DW$416	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$127)

$C$DW$417	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$127)

	.dwendtag $C$DW$T$143

$C$DW$T$144	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$143)
	.dwattr $C$DW$T$144, DW_AT_address_class(0x20)

$C$DW$T$145	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$145, DW_AT_name("__TI_compar_fn")
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$144)
	.dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$145, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x13)

$C$DW$T$63	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$63, DW_AT_name("int32_t")
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$63, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x1d)

$C$DW$T$64	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$64, DW_AT_name("BaseType_t")
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$64, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x12)

$C$DW$T$106	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$64)

$C$DW$T$146	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$64)

$C$DW$T$124	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$124, DW_AT_address_class(0x20)


$C$DW$T$164	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
$C$DW$418	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$3)

	.dwendtag $C$DW$T$164

$C$DW$T$165	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
	.dwattr $C$DW$T$165, DW_AT_address_class(0x20)

$C$DW$T$166	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$166, DW_AT_name("TaskHookFunction_t")
	.dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$165)
	.dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$166, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$166, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$T$166, DW_AT_decl_column(0x16)

$C$DW$T$167	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$167, DW_AT_name("int_fast16_t")
	.dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$167, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$167, DW_AT_decl_line(0x47)
	.dwattr $C$DW$T$167, DW_AT_decl_column(0x17)

$C$DW$T$168	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$168, DW_AT_name("int_fast32_t")
	.dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$168, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$168, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$T$168, DW_AT_decl_column(0x17)

$C$DW$T$169	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$169, DW_AT_name("int_fast8_t")
	.dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$169, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$169, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$169, DW_AT_decl_column(0x17)

$C$DW$T$170	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$170, DW_AT_name("int_least32_t")
	.dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$170, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$170, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$170, DW_AT_decl_column(0x17)

$C$DW$T$171	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$171, DW_AT_name("portBASE_TYPE")
	.dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$171, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$171, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$T$171, DW_AT_decl_column(0x12)

$C$DW$T$172	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$172, DW_AT_name("portLONG")
	.dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$172, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$172, DW_AT_decl_line(0x69)
	.dwattr $C$DW$T$172, DW_AT_decl_column(0x12)

$C$DW$T$173	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$173, DW_AT_name("intptr_t")
	.dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$173, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$173, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$173, DW_AT_decl_column(0x1a)

$C$DW$T$174	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$174, DW_AT_name("ptrdiff_t")
	.dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$174, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stddef.h")
	.dwattr $C$DW$T$174, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$174, DW_AT_decl_column(0x1c)

$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x04)

$C$DW$T$24	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$24, DW_AT_name("size_t")
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$24, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x19)

$C$DW$T$27	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$27, DW_AT_name("uint32_t")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$27, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x1c)

$C$DW$T$28	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$28, DW_AT_name("StackType_t")
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$28, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x12)

$C$DW$T$29	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)

$C$DW$T$30	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$30, DW_AT_address_class(0x20)

$C$DW$T$33	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$33, DW_AT_address_class(0x20)

$C$DW$T$149	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$33)

$C$DW$T$44	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$44, DW_AT_name("TickType_t")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$44, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x76)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x13)

$C$DW$T$100	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$44)

$C$DW$T$177	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$44)

$C$DW$T$98	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$98, DW_AT_address_class(0x20)

$C$DW$T$99	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)

$C$DW$T$32	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$32, DW_AT_name("UBaseType_t")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$32, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x12)

$C$DW$T$179	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$32)

$C$DW$T$159	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$159, DW_AT_address_class(0x20)

$C$DW$T$184	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$184, DW_AT_name("portSTACK_TYPE")
	.dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$184, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$184, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$T$184, DW_AT_decl_column(0x12)

$C$DW$T$36	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$27)

$C$DW$T$185	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$185, DW_AT_name("uint_fast16_t")
	.dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$185, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$185, DW_AT_decl_line(0x48)
	.dwattr $C$DW$T$185, DW_AT_decl_column(0x16)

$C$DW$T$186	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$186, DW_AT_name("uint_fast32_t")
	.dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$186, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$186, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$186, DW_AT_decl_column(0x16)

$C$DW$T$187	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$187, DW_AT_name("uint_fast8_t")
	.dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$187, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$187, DW_AT_decl_line(0x46)
	.dwattr $C$DW$T$187, DW_AT_decl_column(0x16)

$C$DW$T$188	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$188, DW_AT_name("uint_least32_t")
	.dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$188, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$188, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$188, DW_AT_decl_column(0x16)

$C$DW$T$189	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$189, DW_AT_name("uintptr_t")
	.dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$189, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$189, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$189, DW_AT_decl_column(0x1a)

$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x04)

$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x04)

$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x08)

$C$DW$T$192	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$192, DW_AT_name("int64_t")
	.dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$192, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$192, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$192, DW_AT_decl_column(0x21)

$C$DW$T$193	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$193, DW_AT_name("int_fast64_t")
	.dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
	.dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$193, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$193, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$193, DW_AT_decl_column(0x17)

$C$DW$T$194	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$194, DW_AT_name("int_least64_t")
	.dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$192)
	.dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$194, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$194, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$194, DW_AT_decl_column(0x17)

$C$DW$T$195	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$195, DW_AT_name("portDOUBLE")
	.dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$192)
	.dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$195, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$195, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$195, DW_AT_decl_column(0x12)

$C$DW$T$196	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$196, DW_AT_name("intmax_t")
	.dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$196, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$196, DW_AT_decl_line(0x56)
	.dwattr $C$DW$T$196, DW_AT_decl_column(0x20)

$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x08)

$C$DW$T$197	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$197, DW_AT_name("uint64_t")
	.dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$197, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$197, DW_AT_decl_line(0x33)
	.dwattr $C$DW$T$197, DW_AT_decl_column(0x20)

$C$DW$T$198	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$198, DW_AT_name("uint_fast64_t")
	.dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$197)
	.dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$198, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$198, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$198, DW_AT_decl_column(0x16)

$C$DW$T$199	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$199, DW_AT_name("uint_least64_t")
	.dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$197)
	.dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$199, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$199, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$199, DW_AT_decl_column(0x16)

$C$DW$T$200	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$200, DW_AT_name("uintmax_t")
	.dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$200, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdint.h")
	.dwattr $C$DW$T$200, DW_AT_decl_line(0x57)
	.dwattr $C$DW$T$200, DW_AT_decl_column(0x20)

$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x04)

$C$DW$T$201	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$201, DW_AT_name("portFLOAT")
	.dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$201, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/portable/CCS/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$201, DW_AT_decl_line(0x67)
	.dwattr $C$DW$T$201, DW_AT_decl_column(0x10)

$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x08)

$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x08)


$C$DW$T$35	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
$C$DW$419	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$419, DW_AT_upper_bound(0x0f)

	.dwendtag $C$DW$T$35

$C$DW$T$52	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$6)

$C$DW$T$53	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_address_class(0x20)

$C$DW$T$54	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_name("__va_list")
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$420, DW_AT_name("__ap")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("__ap")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$420, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdarg.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0x38)
	.dwattr $C$DW$420, DW_AT_decl_column(0x0c)

	.dwattr $C$DW$T$26, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdarg.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$26

$C$DW$T$203	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$203, DW_AT_name("va_list")
	.dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$203, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$203, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1.LTS/include/stdarg.h")
	.dwattr $C$DW$T$203, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$203, DW_AT_decl_column(0x03)


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_name("tskTaskControlBlock")
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x54)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$421, DW_AT_name("pxTopOfStack")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("pxTopOfStack")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$421, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$421, DW_AT_decl_line(0x88)
	.dwattr $C$DW$421, DW_AT_decl_column(0x18)

$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$422, DW_AT_name("xGenericListItem")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("xGenericListItem")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$422, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$422, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$422, DW_AT_decl_column(0x0f)

$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$423, DW_AT_name("xEventListItem")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("xEventListItem")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$423, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$423, DW_AT_decl_line(0x90)
	.dwattr $C$DW$423, DW_AT_decl_column(0x0f)

$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$424, DW_AT_name("uxPriority")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("uxPriority")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$424, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$424, DW_AT_decl_line(0x91)
	.dwattr $C$DW$424, DW_AT_decl_column(0x10)

$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$425, DW_AT_name("pxStack")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("pxStack")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$425, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$425, DW_AT_decl_line(0x92)
	.dwattr $C$DW$425, DW_AT_decl_column(0x11)

$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$426, DW_AT_name("pcTaskName")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("pcTaskName")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$426, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$426, DW_AT_decl_line(0x93)
	.dwattr $C$DW$426, DW_AT_decl_column(0x0a)

$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$427, DW_AT_name("uxBasePriority")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("uxBasePriority")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$427, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$427, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$427, DW_AT_decl_column(0x10)

$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$428, DW_AT_name("uxMutexesHeld")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("uxMutexesHeld")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$428, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$428, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$428, DW_AT_decl_column(0x10)

$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$429, DW_AT_name("ulNotifiedValue")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("ulNotifiedValue")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$429, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$429, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$429, DW_AT_decl_column(0x15)

$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$430, DW_AT_name("eNotifyState")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("eNotifyState")
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$430, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$430, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$430, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$40, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$40

$C$DW$T$113	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$113, DW_AT_name("tskTCB")
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$113, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$T$113, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$T$113, DW_AT_decl_column(0x03)

$C$DW$T$114	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$114, DW_AT_name("TCB_t")
	.dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$114, DW_AT_decl_file("../Source/tasks.c")
	.dwattr $C$DW$T$114, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$T$114, DW_AT_decl_column(0x10)

$C$DW$T$115	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$T$115, DW_AT_address_class(0x20)

$C$DW$T$116	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$115)

$C$DW$T$207	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$115)


$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_name("xLIST")
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$431, DW_AT_name("uxNumberOfItems")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("uxNumberOfItems")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$431, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$431, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$431, DW_AT_decl_column(0x22)

$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$432, DW_AT_name("pxIndex")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("pxIndex")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$432, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$432, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$432, DW_AT_decl_column(0x23)

$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$433, DW_AT_name("xListEnd")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("xListEnd")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$433, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$433, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$433, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$43, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$43

$C$DW$T$88	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$88, DW_AT_name("List_t")
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$88, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$T$88, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$T$88, DW_AT_decl_column(0x03)

$C$DW$T$152	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$88)

$C$DW$T$153	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
	.dwattr $C$DW$T$153, DW_AT_address_class(0x20)

$C$DW$T$154	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$153)

$C$DW$T$89	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_address_class(0x20)

$C$DW$T$90	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)

$C$DW$T$208	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$208, DW_AT_type(*$C$DW$T$89)


$C$DW$T$209	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$209, DW_AT_byte_size(0x64)
$C$DW$434	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$434, DW_AT_upper_bound(0x04)

	.dwendtag $C$DW$T$209


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_name("xLIST_ITEM")
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x14)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$435, DW_AT_name("xItemValue")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("xItemValue")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$435, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$435, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$435, DW_AT_decl_column(0x21)

$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$436, DW_AT_name("pxNext")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("pxNext")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$436, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$436, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$436, DW_AT_decl_column(0x2a)

$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$437, DW_AT_name("pxPrevious")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("pxPrevious")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$437, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$437, DW_AT_decl_line(0xba)
	.dwattr $C$DW$437, DW_AT_decl_column(0x2a)

$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$438, DW_AT_name("pvOwner")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("pvOwner")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$438, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$438, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$438, DW_AT_decl_column(0x09)

$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$439, DW_AT_name("pvContainer")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("pvContainer")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$439, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$439, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$439, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$46, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$46

$C$DW$T$31	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$31, DW_AT_name("ListItem_t")
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x1b)

$C$DW$T$41	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$41, DW_AT_address_class(0x20)

$C$DW$T$93	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$41)

$C$DW$T$45	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$45, DW_AT_address_class(0x20)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_name("xMEMORY_REGION")
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x0c)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$440, DW_AT_name("pvBaseAddress")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("pvBaseAddress")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$440, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$440, DW_AT_decl_line(0x91)
	.dwattr $C$DW$440, DW_AT_decl_column(0x08)

$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$441, DW_AT_name("ulLengthInBytes")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("ulLengthInBytes")
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$441, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$441, DW_AT_decl_line(0x92)
	.dwattr $C$DW$441, DW_AT_decl_column(0x0b)

$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$442, DW_AT_name("ulParameters")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("ulParameters")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$442, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$442, DW_AT_decl_line(0x93)
	.dwattr $C$DW$442, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$47, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$47

$C$DW$T$56	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$56, DW_AT_name("MemoryRegion_t")
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$56, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x94)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x03)

$C$DW$T$117	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$56)

$C$DW$T$118	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$T$118, DW_AT_address_class(0x20)

$C$DW$T$119	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)


$C$DW$T$57	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x0c)
$C$DW$443	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$443, DW_AT_upper_bound(0x00)

	.dwendtag $C$DW$T$57


$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_name("xMINI_LIST_ITEM")
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x0c)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$444, DW_AT_name("xItemValue")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("xItemValue")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$444, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$444, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$444, DW_AT_decl_column(0x21)

$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$445, DW_AT_name("pxNext")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("pxNext")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$445, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$445, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$445, DW_AT_decl_column(0x2a)

$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$446, DW_AT_name("pxPrevious")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("pxPrevious")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$446, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$446, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$446, DW_AT_decl_column(0x2a)

	.dwattr $C$DW$T$48, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$48

$C$DW$T$42	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$42, DW_AT_name("MiniListItem_t")
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$42, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS823_LM3S1968_ADC_MultMeas\Source\include\list.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x20)


$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_name("xTASK_PARAMETERS")
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x24)
$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$447, DW_AT_name("pvTaskCode")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("pvTaskCode")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$447, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$447, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$447, DW_AT_decl_column(0x11)

$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$448, DW_AT_name("pcName")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("pcName")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$448, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$448, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$448, DW_AT_decl_column(0x15)

$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$449, DW_AT_name("usStackDepth")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("usStackDepth")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$449, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$449, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$449, DW_AT_decl_column(0x0b)

$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$450, DW_AT_name("pvParameters")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("pvParameters")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$450, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$450, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$450, DW_AT_decl_column(0x08)

$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$451, DW_AT_name("uxPriority")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("uxPriority")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$451, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$451, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$451, DW_AT_decl_column(0x0e)

$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$452, DW_AT_name("puxStackBuffer")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("puxStackBuffer")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$452, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$452, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$452, DW_AT_decl_column(0x0f)

$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$453, DW_AT_name("xRegions")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("xRegions")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$453, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$453, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$453, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$58, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x99)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$58

$C$DW$T$213	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$213, DW_AT_name("TaskParameters_t")
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$213, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$213, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$T$213, DW_AT_decl_column(0x03)


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_name("xTASK_STATUS")
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x20)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$454, DW_AT_name("xHandle")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("xHandle")
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$454, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$454, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$454, DW_AT_decl_column(0x0f)

$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$455, DW_AT_name("pcTaskName")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("pcTaskName")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$455, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$455, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$455, DW_AT_decl_column(0x0e)

$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$456, DW_AT_name("xTaskNumber")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("xTaskNumber")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$456, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$456, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$456, DW_AT_decl_column(0x0e)

$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$457, DW_AT_name("eCurrentState")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("eCurrentState")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$457, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$457, DW_AT_decl_line(0xab)
	.dwattr $C$DW$457, DW_AT_decl_column(0x0d)

$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$458, DW_AT_name("uxCurrentPriority")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("uxCurrentPriority")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$458, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$458, DW_AT_decl_line(0xac)
	.dwattr $C$DW$458, DW_AT_decl_column(0x0e)

$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$459, DW_AT_name("uxBasePriority")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("uxBasePriority")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$459, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$459, DW_AT_decl_line(0xad)
	.dwattr $C$DW$459, DW_AT_decl_column(0x0e)

$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$460, DW_AT_name("ulRunTimeCounter")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("ulRunTimeCounter")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$460, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$460, DW_AT_decl_line(0xae)
	.dwattr $C$DW$460, DW_AT_decl_column(0x0b)

$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$461, DW_AT_name("usStackHighWaterMark")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("usStackHighWaterMark")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$461, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$461, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$461, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$62, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$62

$C$DW$T$214	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$214, DW_AT_name("TaskStatus_t")
	.dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$214, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$214, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$T$214, DW_AT_decl_column(0x03)


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_name("xTIME_OUT")
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x08)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$462, DW_AT_name("xOverflowCount")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("xOverflowCount")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$462, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$462, DW_AT_decl_line(0x88)
	.dwattr $C$DW$462, DW_AT_decl_column(0x0d)

$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$463, DW_AT_name("xTimeOnEntering")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("xTimeOnEntering")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$463, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$463, DW_AT_decl_line(0x89)
	.dwattr $C$DW$463, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$65, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$65

$C$DW$T$108	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$108, DW_AT_name("TimeOut_t")
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$108, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS823_LM3S1968_ADC_MultMeas/Source/include/task.h")
	.dwattr $C$DW$T$108, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$T$108, DW_AT_decl_column(0x03)

$C$DW$T$109	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$T$109, DW_AT_address_class(0x20)

$C$DW$T$110	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)

	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 14
	.dwcfi	cfa_register, 13
	.dwcfi	cfa_offset, 0
	.dwcfi	undefined, 0
	.dwcfi	undefined, 1
	.dwcfi	undefined, 2
	.dwcfi	undefined, 3
	.dwcfi	same_value, 4
	.dwcfi	same_value, 5
	.dwcfi	same_value, 6
	.dwcfi	same_value, 7
	.dwcfi	same_value, 8
	.dwcfi	same_value, 9
	.dwcfi	same_value, 10
	.dwcfi	same_value, 11
	.dwcfi	undefined, 12
	.dwcfi	undefined, 13
	.dwcfi	undefined, 14
	.dwcfi	undefined, 14
	.dwcfi	undefined, 7
	.dwendentry
	.dwendtag $C$DW$CU

